app/controllers/admin/users_controller.rb

  def find_user
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 11) LIMIT 1