app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (LOWER(login) = 'vamshi') LIMIT 1
---
  def show
   # @user = User.find(params[:id])
   @users = User.all

UPDATE `users` SET `password_salt` = 'OYJr5De_k5iVjMjeaN98', `crypted_password` = '8862b85495b2beb70d87a7e3c871c2b6fbab776a6f80118b239afac960a89d9ce550ab36f0fe2052e9b11b19357d1f07439aa8ab62e841b98121802ad0ff5af9', `persistence_token` = '4bdf4fa1ffffa345b168507442b4b31ac2db3f5df00f2a49251e4152ea78cc8614ac82e14f5c029f818cb3d1d101d4dcdaabb570cf14af3baca9e2af0b4f976d', `perishable_token` = 'doGrOqhIQn3cYF9CsVR_', `last_request_at` = '2011-02-09 16:26:51', `login_count` = 3, `last_login_at` = '2011-02-09 16:26:28', `current_login_at` = '2011-02-09 16:26:51', `updated_at` = '2011-02-09 16:26:51' WHERE (`users`.`id` = 10)
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])