app/views/admin/users/index.html.erb

<h4>Online Users</h4>
::<%= current_user.count_online_users%>
---
SELECT COUNT(*) FROM `users` WHERE (last_request_at > '2011-02-09 19:04:31')